In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [3]:
ser1 = Series([2,np.nan,4,np.nan,6,np.nan], 
             index=['Q','R','S','T','U','V'])
ser1

Q    2.0
R    NaN
S    4.0
T    NaN
U    6.0
V    NaN
dtype: float64

In [4]:
ser2 = Series(np.arange(len(ser1)),dtype=np.float64, 
             index=['Q','R','S','T','U','V'])
ser2

Q    0.0
R    1.0
S    2.0
T    3.0
U    4.0
V    5.0
dtype: float64

In [5]:
# We are checking where the value of ser1 is null
# If it true (that the value is null)
# then we pass the value of ser2
# if it is not null, we pass the value of ser1
# using the index of ser1

Series(np.where(pd.isnull(ser1), ser2, ser1), index=ser1.index)

Q    2.0
R    1.0
S    4.0
T    3.0
U    6.0
V    5.0
dtype: float64

In [7]:
# This method is the same as the previous method 
# It looks for the ser1
# If it is not null, it combines it with ser2
ser1.combine_first(ser2)

Q    2.0
R    1.0
S    4.0
T    3.0
U    6.0
V    5.0
dtype: float64

In [9]:
nan = np.nan
dframe_odds = DataFrame({'X':[1.,nan,3.,nan],
                        'Y':[nan,5.,nan,7.],
                        'Z':[nan,9.,nan,11]})
dframe_odds

     X    Y     Z
0  1.0  NaN   NaN
1  NaN  5.0   9.0
2  3.0  NaN   NaN
3  NaN  7.0  11.0

In [11]:
nan = np.nan
dframe_evens = DataFrame({'X':[2.,4,nan,6.,8.],
                        'Y':[nan,10.,12.,14., 16.]})
dframe_evens

     X     Y
0  2.0   NaN
1  4.0  10.0
2  NaN  12.0
3  6.0  14.0
4  8.0  16.0

In [13]:
# Check for the odds
# if there are null values
# then we get the info from dframe_even
dframe_odds.combine_first(dframe_evens)

     X     Y     Z
0  1.0   NaN   NaN
1  4.0   5.0   9.0
2  3.0  12.0   NaN
3  6.0   7.0  11.0
4  8.0  16.0   NaN